package com.example.itogovoe.utils

// TODO: Сделать во вью моделях вызовы в из бд через .let{}

// TODO: HomeFragment
//  - должен сохраняться выбранный элемент при перевороте экрана

// TODO: FilterFragment
//  - Переделать FilterFragment под sealed class
//  - Перенести всю бизнес логику из FilterFragment во ViewModel
//  1. сделать фильтр по валютам
//  - По нажатию на одну из валют в фильтере будет отображаться только та валюта, где она есть (можно выбрать несколько)
//  - При повторном нажатии выбор данной валюты отменяется (либо сделать кнопку сброса фильтра по валютам)
//  - На экране с историей будет видно, что применён фильтр по валютам

// TODO: - AnalyticFragment
// TODO: - возможно использовать api какой нибудь биржи тенденции валют