package com.example.itogovoe.utils

// TODO: HomeFragment
//  1. должен сохраняться выбранный элемент при перевороте экрана
//  2. SearchView
//  - при поиске валют можно выбрать валюту
//  - выбранная валюта остаётся после изменения поискового запроса или его удаления
//  3.  Добавить Flow (подписка на таблицу)


// TODO: Сделать правильную передачу валют в ExchangeFragment из CurrencyFragment (как в ТЗ)

// TODO: AnalyticFragment

// TODO: Попробовать сделать Dagger
// TODO: Прикрепить крашлитику, везде где приложение может упасть, если вдруг будет ошибка,
//  эти данные записывать и отправлять в крашлитику (Firebase)
// TODO: Сделать локализацию хотя бы на 2 языка (RU, EN)
// TODO: взять любой стор и там опубликовать (российский стор)
// TODO: Сделать крутой readMe на гите с картинками, описаниями, ссылкин на сторы (всё как надо крч)

// TODO: в следующем приложении заюзать Dagger,
//  Android Architecture components (ViewModel, liveData, Room),
//  Coroutines - Flow / RxJava
//  Android SDK,
//  Shared preferences
//  знать котлин(основы программирования, ООП, SOLID, Архитектура), JVM, JRE, JDK
//  Как работает Android приложение
//   - как запускается - собирается - выглядит после сборки(APK, DEX) - как распаковывается - запускается
//  P.S. Загуглить Android Архитектура with modules