package com.example.itogovoe.utils

// TODO:
//  Сделать отображение progressBar задействуя UiModel, добавив туда val isLoading: Boolean

// TODO: HomeFragment
//  - должен сохраняться выбранный элемент при перевороте экрана

// TODO: FilterFragment
//  1. сделать фильтр по валютам
//  - По нажатию на одну из валют в фильтере будет отображаться только та валюта, где она есть (можно выбрать несколько)
//  - При повторном нажатии выбор данной валюты отменяется (либо сделать кнопку сброса фильтра по валютам)
//  - На экране с историей будет видно, что применён фильтр по валютам

// TODO: AnalyticFragment